app/controllers/settings/account_controller.rb

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "email" = 'user@gmail.com', "encrypted_password" = 'c2a3945c89aa8e777d62bbf16313bd34f662a49796f85d9fa788078a02cc4250', "name" = 'New Name', "updated_at" = '2010-11-18 06:53:36.771982' WHERE ("users"."id" = 1)