app/controllers/settings/email_accounts_controller.rb

  def index
    @email_account = EmailAccount.new
    @email_accounts = current_user.email_account.paginate(:page => params[:page])
---
SELECT "email_accounts".* FROM "email_accounts" WHERE ("email_accounts".user_id = 6) LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "email_accounts" WHERE ("email_accounts".user_id = 7)) AS subquery

  def create
    @email_account = current_user.email_account.build(params[:email_account])

    if @email_account.save
      flash[:success] = "Email account add."
      redirect_to
    else
      @email_accounts = current_user.email_account.paginate(:page => params[:page])
---
INSERT INTO "email_accounts" ("created_at", "email", "password", "updated_at", "user_id") VALUES ('2010-11-16 06:11:12.607121', 'Qwerty78@gmail.com', '123456', '2010-11-16 06:11:12.607121', 7)
SELECT "email_accounts"."id" FROM "email_accounts" WHERE (LOWER("email_accounts"."email") = LOWER('')) AND ("email_accounts"."user_id" = 6) LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "email_accounts" WHERE ("email_accounts".user_id = 7)) AS subquery

  def destroy
    @email_account = EmailAccount.find(params[:id])

    @email_account.destroy
---
SELECT "email_accounts".* FROM "email_accounts" WHERE ("email_accounts".user_id = 7) AND ("email_accounts"."id" = 8) LIMIT 1
DELETE FROM "email_accounts" WHERE ("email_accounts"."id" = 6)