app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "lost_password", "name", "salt", "updated_at") VALUES (NULL, '2010-11-05 05:43:12.341450', 'ron9.GOL@gmail.com', '8d171128161450aad2a0b7d035db6953b7c58d58e54ffec548fb6e4937f70d03', NULL, 'ButuzGOL', '8bfde7be285f382efc48693c50972d8158d000041b48315cb56a5171cf079cca', '2010-11-05 05:43:12.341450')

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1